; domain
(define 
	(domain hanoitower)
	(:requirements :adl)
	(:predicates 
		(krazek ?krazek)
		(pal ?pal)
		(wiekszy ?wiekszy ?mniejszy)
		(na-ziemi ?x)
		(na ?krazekNa ?krazekPod)
		(na-palu ?krazek ?pal)
	)
	
	(:action przesun-na-pusty
		:parameters( ?skad ?dokad ?krazek)
		:precondition
		(and
			(krazek ?krazek)
			(pal ?skad)
			(pal ?dokad)
			(not(exists (?x) (na ?x ?krazek)))
			(na-palu ?krazek ?skad)
			(not(na-palu ?krazek ?dokad))
			(not (= ?skad ?dokad))
			(not(exists (?x) (na-palu ?x ?dokad)))
		)
		:effect
		(and
			(na-ziemi ?krazek)
			(na-palu ?krazek ?dokad)
			(not(na-palu ?krazek ?skad))
			(forall (?x) (not(na ?krazek ?x)))
		)
	)
	
	(:action przesun-na-krazek
		:parameters (?skad ?dokad ?krazekmniejszy ?krazekwiekszy)
		:precondition
		(and
			(pal ?skad)
			(pal ?dokad)
			(krazek ?krazekmniejszy)
			(krazek ?krazekwiekszy)
			(not(= ?skad ?dokad))
			(not(= ?krazekmniejszy ?krazekwiekszy))
			
			(wiekszy ?krazekwiekszy ?krazekmniejszy)
			(not(exists (?x) (na ?x ?krazekmniejszy)))
			(not(exists (?x) (na ?x ?krazekwiekszy)))
			(na-palu ?krazekmniejszy ?skad)
			(na-palu ?krazekwiekszy ?dokad)
		)
		:effect
		(and
			(na ?krazekmniejszy ?krazekwiekszy)
			(not(na-palu ?krazekmniejszy ?skad))
			(na-palu ?krazekmniejszy ?dokad)
			(forall (?x) (not(na ?krazekmniejszy ?x)))
		)
	) 
)

; problem
(define (problem hanoitower)
	(:domain hanoitower)
	(:objects
		x y z 
		p1 p2 p3 p4 p5
	)
	(:init
		(pal x)
		(pal y)
		(pal z)
		
		(krazek p1)
		(krazek p2)
		(krazek p3)
		(krazek p4)
		(krazek p5)
		
		(wiekszy p5 p4)
		(wiekszy p5 p3)
		(wiekszy p5 p2)
		(wiekszy p5 p1)

		(wiekszy p4 p3)
		(wiekszy p4 p2)
		(wiekszy p4 p1)
		
		(wiekszy p3 p2)
		(wiekszy p3 p1)
		
		(wiekszy p2 p1)
		
		(na-ziemi p5)
		
		(na p4 p5)
		(na p3 p4)
		(na p2 p3)
		(na p1 p2)
		
		(na-palu p1 x)
		(na-palu p2 x)
		(na-palu p3 x)
		(na-palu p4 x)
		(na-palu p5 x)
		
		
	)
	(:goal	
		(and
			(pal x)
			(pal y)
			(pal z)
			
			(krazek p1)
			(krazek p2)
			(krazek p3)
			(krazek p4)
			(krazek p5)
			
			(wiekszy p5 p4)
			(wiekszy p5 p3)
			(wiekszy p5 p2)
			(wiekszy p5 p1)
	
			(wiekszy p4 p3)
			(wiekszy p4 p2)
			(wiekszy p4 p1)
			
			(wiekszy p3 p2)
			(wiekszy p3 p1)
			
			(wiekszy p2 p1)
			
			(na-ziemi p5)
			
			(na p4 p5)
			(na p3 p4)
			(na p2 p3)
			(na p1 p2)
			
			(na-palu p1 z)
			(na-palu p2 z)
			(na-palu p3 z)
			(na-palu p4 z)
			(na-palu p5 z)
				
		)
	)


)

; plan
1. (przesun-na-pusty x z p1)
   deleted: (na-palu p1 x) (na p1 p2)
   added: (na-ziemi p1) (na-palu p1 z)
   goals met: 23 of 28
2. (przesun-na-pusty x y p2)
   deleted: (na-palu p2 x) (na p2 p3)
   added: (na-ziemi p2) (na-palu p2 y)
   goals met: 22 of 28
3. (przesun-na-krazek z y p1 p2)
   deleted: (na-palu p1 z)
   added: (na p1 p2) (na-palu p1 y)
   goals met: 22 of 28
4. (przesun-na-pusty x z p3)
   deleted: (na-palu p3 x) (na p3 p4)
   added: (na-ziemi p3) (na-palu p3 z)
   goals met: 22 of 28
5. (przesun-na-krazek y x p1 p4)
   deleted: (na-palu p1 y) (na p1 p2)
   added: (na p1 p4) (na-palu p1 x)
   goals met: 21 of 28
6. (przesun-na-krazek y z p2 p3)
   deleted: (na-palu p2 y)
   added: (na p2 p3) (na-palu p2 z)
   goals met: 23 of 28
7. (przesun-na-krazek x z p1 p2)
   deleted: (na-palu p1 x) (na p1 p4)
   added: (na p1 p2) (na-palu p1 z)
   goals met: 25 of 28
8. (przesun-na-pusty x y p4)
   deleted: (na-palu p4 x) (na p4 p5)
   added: (na-ziemi p4) (na-palu p4 y)
   goals met: 24 of 28
9. (przesun-na-krazek z y p1 p4)
   deleted: (na-palu p1 z) (na p1 p2)
   added: (na p1 p4) (na-palu p1 y)
   goals met: 22 of 28
10. (przesun-na-krazek z x p2 p5)
   deleted: (na-palu p2 z) (na p2 p3)
   added: (na p2 p5) (na-palu p2 x)
   goals met: 20 of 28
11. (przesun-na-krazek y x p1 p2)
   deleted: (na-palu p1 y) (na p1 p4)
   added: (na p1 p2) (na-palu p1 x)
   goals met: 21 of 28
12. (przesun-na-krazek z y p3 p4)
   deleted: (na-palu p3 z)
   added: (na p3 p4) (na-palu p3 y)
   goals met: 21 of 28
13. (przesun-na-pusty x z p1)
   deleted: (na-palu p1 x) (na p1 p2)
   added: (na-palu p1 z)
   goals met: 21 of 28
14. (przesun-na-krazek x y p2 p3)
   deleted: (na-palu p2 x) (na p2 p5)
   added: (na p2 p3) (na-palu p2 y)
   goals met: 22 of 28
15. (przesun-na-krazek z y p1 p2)
   deleted: (na-palu p1 z)
   added: (na p1 p2) (na-palu p1 y)
   goals met: 22 of 28
16. (przesun-na-pusty x z p5)
   deleted: (na-palu p5 x)
   added: (na-palu p5 z)
   goals met: 23 of 28
17. (przesun-na-pusty y x p1)
   deleted: (na-palu p1 y) (na p1 p2)
   added: (na-palu p1 x)
   goals met: 22 of 28
18. (przesun-na-krazek y z p2 p5)
   deleted: (na-palu p2 y) (na p2 p3)
   added: (na p2 p5) (na-palu p2 z)
   goals met: 22 of 28
19. (przesun-na-krazek x z p1 p2)
   deleted: (na-palu p1 x)
   added: (na p1 p2) (na-palu p1 z)
   goals met: 24 of 28
20. (przesun-na-pusty y x p3)
   deleted: (na-palu p3 y) (na p3 p4)
   added: (na-palu p3 x)
   goals met: 23 of 28
21. (przesun-na-krazek z y p1 p4)
   deleted: (na-palu p1 z) (na p1 p2)
   added: (na p1 p4) (na-palu p1 y)
   goals met: 21 of 28
22. (przesun-na-krazek z x p2 p3)
   deleted: (na-palu p2 z) (na p2 p5)
   added: (na p2 p3) (na-palu p2 x)
   goals met: 21 of 28
23. (przesun-na-krazek y x p1 p2)
   deleted: (na-palu p1 y) (na p1 p4)
   added: (na p1 p2) (na-palu p1 x)
   goals met: 22 of 28
24. (przesun-na-krazek y z p4 p5)
   deleted: (na-palu p4 y)
   added: (na p4 p5) (na-palu p4 z)
   goals met: 24 of 28
25. (przesun-na-krazek x z p1 p4)
   deleted: (na-palu p1 x) (na p1 p2)
   added: (na p1 p4) (na-palu p1 z)
   goals met: 24 of 28
26. (przesun-na-pusty x y p2)
   deleted: (na-palu p2 x) (na p2 p3)
   added: (na-palu p2 y)
   goals met: 23 of 28
27. (przesun-na-krazek z y p1 p2)
   deleted: (na-palu p1 z) (na p1 p4)
   added: (na p1 p2) (na-palu p1 y)
   goals met: 23 of 28
28. (przesun-na-krazek x z p3 p4)
   deleted: (na-palu p3 x)
   added: (na p3 p4) (na-palu p3 z)
   goals met: 25 of 28
29. (przesun-na-pusty y x p1)
   deleted: (na-palu p1 y) (na p1 p2)
   added: (na-palu p1 x)
   goals met: 24 of 28
30. (przesun-na-krazek y z p2 p3)
   deleted: (na-palu p2 y)
   added: (na p2 p3) (na-palu p2 z)
   goals met: 26 of 28
31. (przesun-na-krazek x z p1 p2)
   deleted: (na-palu p1 x)
   added: (na p1 p2) (na-palu p1 z)
   goals met: 28 of 28
